### Задание 1

Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

__Комментарий к решению:__

Все-таки запутался с типом Series ближе к концу — не понял, как из него получить можно бы просто айди фильма, который z отсортировал по самому большому числу оценок 5 (пришлось криво преобразовывать это в строку, делить, превращать в цифру и уже так отдавать другому файлу — подозреваю, что пандас умеет это делать проще)

In [195]:
import pandas as pd

In [202]:
films = pd.read_csv('ratings2.csv')
films.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [203]:
films_5_0 = films[ films['rating'] == 5.0 ]

In [204]:
films_5_0['movieId'].value_counts().sort_values(ascending=False).head()

318     153
296     123
356     116
2571    109
260     104
Name: movieId, dtype: int64

In [205]:
mm = films_5_0['movieId'].value_counts().sort_values(ascending=False).head(1)

In [206]:
my_film_num = int(str(mm).split(' ')[0])

In [207]:
mov = pd.read_csv('movies2.csv')
mov[ (mov['movieId']==my_film_num) ]['title']

277    Shawshank Redemption, The (1994)
Name: title, dtype: object

### Задание 2

По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

__Комментарий__

Сначала последовательно разными методами вроде получил искомое, ниже объединил это в одну функцию все же

In [208]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [209]:
power[ power['country'].str.contains('est', case=False) ]['country'].unique()

array(['Estonia', 'State of Palestine', 'Timor-Leste'], dtype=object)

In [210]:
power[ power['country'].str.contains('lit', case=False) ]['country'].unique()

array(['Lithuania'], dtype=object)

In [211]:
power[ power['country'].str.contains('lat', case=False) ]['country'].unique()

array(['Latvia'], dtype=object)

In [212]:
power_filtered = power[ ((power['country']=='Estonia') | (power['country']=='Lithuania') | \
                       (power['country']=='Lithuania')) & ((power['category']==1) | (power['category']==1) \
                       | (power['category']==21)) ]
power_filtered.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [213]:
power_filtered['year'].head()

373    2014
374    2013
375    2012
376    2011
377    2010
Name: year, dtype: int64

In [214]:
#вот тут пытался написать сначала условие типа 2005 <= power_filtered['year'] <= 2010 — но питон начал ругаться сильно,
# поэтому вот так попробовал записать

t = power_filtered[ (power_filtered['year'] <= 2010) & (2005 <= power_filtered['year']) & \
                   (power_filtered['quantity'] >= 0)]
t.tail()

          country  year  quantity  category
253982  Lithuania  2009      98.0        21
253983  Lithuania  2008      54.0        21
253984  Lithuania  2007      47.0        21
253985  Lithuania  2006      31.0        21
253986  Lithuania  2005       1.0        21

In [215]:
sum(t['quantity'])

181509.0

In [216]:
def baltic_power(file_name):
    
    power = pd.read_csv(file_name)
    
    power_filtered = power[ ((power['country']=='Estonia') | (power['country']=='Lithuania') | \
                       (power['country']=='Lithuania')) & ((power['category']==1) | (power['category']==1) \
                       | (power['category']==21)) ]
    
    power_filtered_by_years = power_filtered[ (power_filtered['year'] <= 2010) & (2005 <= power_filtered['year']) & \
                   (power_filtered['quantity'] >= 0) ]
    
    return sum(power_filtered_by_years['quantity'])

In [217]:
baltic_power('power.csv')

181509.0

### Задание 3

Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [218]:
df = pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', encoding='utf-8')[1]

In [219]:
df.head()

,Unnamed: 0,Рубль,Предложение,Спрос,Предыдущее закрытие,%,Абсолютное значение,Время
0,NaN,GBP/RUB,894576,-,894891,"-0,04 %",-00315,07.03.2020
1,NaN,EUR/RUB,773875,-,758920,"1,97 %",14955,07.03.2020
2,NaN,USD/RUB,685595,-,685630,"-0,01 %",-00035,07.03.2020
3,NaN,JPY/RUB,06506,-,06513,"-0,11 %",-00007,07.03.2020
4,NaN,CNY/RUB,98908,-,98932,"-0,02 %",-00024,07.03.2020

In [220]:
df1 = pd.read_html('https://www.thecompleteuniversityguide.co.uk/league-tables/rankings')[0]

In [221]:
df1.head()

,Unnamed: 0,Rank,Rank.1,University Name,Entry Standards Entry Standards The average UCAS tariff score of new students entering the university. Read more,Student Satisfaction Student Satisfaction A guide to how satisfied students are with the quality of teaching they receive. Maximum score: 5.00 Read more,Research Quality Research Quality A measure of the quality of the research undertaken in the university. Maximum score: 4.00 Read more,Graduate Prospects Graduate Prospects A guide to the success of graduates on completion of their courses at the university. Maximum score: 100.0 Read more,"Overall Score Overall Score The total score calculated by our independent and trusted methodology, comprising entry standards, student satisfaction, research assessment (quality and intensity), graduate prospects, studentâstaff ratio, academic services spend, facilities spend, good honours, and degree completion. Maximum score: 1000 Read more",Next Steps
0,NaN,1st,0,Cambridge,224,4.09,3.33,86.7,1000,Profile Courses
1,NaN,2nd,0,Oxford,215,4.10,3.34,83.4,989,Profile Courses
2,NaN,3rd,2,St Andrews,207,4.26,3.13,79.7,944,Profile Courses
3,NaN,4th,1,London School of Economics,189,3.67,3.35,86.1,934,Profile Courses
4,NaN,5th,1,Imperial College London,205,4.02,3.36,90.4,933,Profile Courses

In [222]:
df1['University Name'].head()

0                     Cambridge
1                        Oxford
2                    St Andrews
3    London School of Economics
4       Imperial College London
Name: University Name, dtype: object